#include <stdio.h>
#include <locale.h>
int main()
{
    setlocale(LC_ALL, "Rus");
    int A[6][9] = {
        {1, 2, 3, 4, 5, 6, 7, 8, 9},
        {2, 3, 4, 5, 6, 7, 8, 9, 10},
        {3, 4, 5, 6, 7, 8, 9, 10, 11},
        {4, 5, 6, 7, 8, 9, 10, 11, 12},
        {5, 6, 7, 8, 9, 10, 11, 12, 13},
        {6, 7, 8, 9, 10, 11, 12, 13, 14}
    };
    int sum;
    // Находим сумму элементов заштрихованной области
    for (int j = 0; j < 9; j++)
    {
        sum = 0;
        for (int i = 3; i < 6; i++)
        {
            sum += A[i][j];
        }
        printf("Сумма %d-го столбца: %d\n", j + 1, sum);
    }
    return 0;
}